{
  "id": "Im_ni-SLFpU",
  "title": "Sender: The Sci-Fi Thriller That Will Blow Your Mind | Full Movie | 4K Ultra",
  "description": "Sender: The Sci-Fi Thriller That Will Blow Your Mind | Full Movie | 4K Ultra\n\n\"Sender\" is a gripping sci-fi thriller that delves deep into the hidden world of psychic research and clandestine experiments. For decades, shadow governments and private corporations have kept their sinister projects buried from public view. But when a young, gifted woman is discovered unconscious on a desolate island in the North Atlantic, secrets begin to unravel.\n\nAs a compassionate doctor takes her in, he realizes she possesses extraordinary psychic abilities that grow more powerful—and more dangerous—with each passing day. Her presence ignites a frantic, global chase, as a violent and ruthless organization will stop at nothing to capture her. The woman's mysterious past, the truth of her arrival on the island, and her escalating powers lead to shocking revelations and devastating consequences.\n\n\"Sender\" is a heart-pounding exploration of human potential, the dangers of unchecked ambition, and the lengths to which humanity will go to control the unknown. avrorapal173 Prepare for a story that will keep you on the edge of your seat until its electrifying conclusion.\n\nHey Everyone!\n\"More Movies in English\" is your go-to YouTube channel for all things movies and TV shows! If you're a film buff or a TV series enthusiast, you've just stumbled upon your new favorite destination!\n\nJoin Our Community:\nAt \"More Movies in English\" we believe that movies and TV shows are more than just entertainment – they're a way to connect with others who share your passions. Join our community of film enthusiasts, where you can discuss your favorite moments, debate plot twists, and connect with fellow fans.\n\nhttps://www.youtube.com/channel/UCwv_SvOgZP8ior3GoxZZbqw?sub_confirmation=1\n\nDon't forget to hit that subscribe button and ring the notification bell so you never miss an exciting review, analysis, or movie trivia challenge. Grab your popcorn, settle into your favorite spot, and let's embark on a cinematic journey together. \"More Movies in English\" – where movies and TV shows come to life!",
  "creator": "More Movies in English",
  "thumbnail": "https://i.ytimg.com/vi/Im_ni-SLFpU/hqdefault.jpg",
  "source": "YouTube",
  "channel": "More Movies in English"
}