{
  "id": "wHhQlCzFza0",
  "title": "Marvelous Musical Mansion | Full Movie | Wee Sing",
  "description": "A mysterious package from Timbuktu? A door knocker that rattles off riddles? Music boxes that come to life? Piccolo Pizza and Piano Pudding? Where will you find such magical, musical, mysterious things? At Uncle Rubato’s Marvelous Musical Mansion! Dance and sing in every room with enchanting new friends and help Uncle Rubato, Aunty Annabella, Alex, Benji, and Kelly solve a most baffling mystery---who or what took all the missing musical treasures? Enjoy this wholesome entertainment for the entire family. Dazzling sets and over 20 uplifting song and dance numbers showcase adorable characters who inspire the love of music while sharing important values including self-esteem and being considerate of others.\n\n#weesing #kidssongs #kidsmusic #nostalgia\n\nSubscribe Link: https://www.youtube.com/@Weesing\n\nWee Sing was created in 1977 by Pam Beall and Susan Nipp, two music educators with a passion for enriching the lives of kids through music and the performing arts.\n\nWee Sing provides an interactive opportunity for preschoolers and young children to learn important life skills like language, coordination, and body awareness through fun children’s songs, chants, and dances.\n\nMore than 67 million books, audios, live-action videos and apps later, Wee Sing is recognized as one of the world’s most cherished children’s brands – and a leader in preschool learning through music.\n\nSUPPORT WEE SING\nWee Sing iTunes Link: https://itunes.apple.com/us/artist/we...\nWee Sing Books and CDs: http://weesing.com/Books-Music\nWee Sing DVDs: http://weesing.com/DVDs\nWee Sing on Amazon: http://www.amazon.com/s/ref=sr_shvl_1...\n\nLink to website: http://www.weesing.com\n\nFind us on social:\nWee Sing Facebook: https://www.facebook.com/weesing \nWee Sing Twitter: https://twitter.com/weesing\n\nMarvelous Musical Mansion | Full Movie | Wee Sing\nhttps://youtu.be/wHhQlCzFza0",
  "creator": "Wee Sing",
  "thumbnail": "https://i.ytimg.com/vi/wHhQlCzFza0/hqdefault.jpg",
  "source": "YouTube",
  "channel": "Wee Sing"
}