{
  "id": "XN1DbOEH-uQ",
  "title": "A millionaire pretends to be homeless and discovers real life - Full Movie - My Secret Billionaire",
  "description": "A millionaire pretends to be homeless and discovers real life - Full Movie - My Secret Billionaire\n\nMy Secret Billionaire\n\nRenowned businessman Sebastian Crowe, the owner of a multimillion-dollar corporation, unexpectedly decides to fulfill a long-forgotten promise made to his late father: to understand what it means to \"live a simple life.\" Leaving behind the luxury of Manhattan offices, Sebastian disguises himself as a homeless man on the bustling streets of New York City.\n\nHis first encounter with street life is a shock, but he gradually finds new friends among those sharing his newfound reality. During his experiment, Sebastian meets Emma, a kind-hearted idealist who works at a charity center. Her unwavering faith in people inspires him to view life and business from a different perspective.\n\nSebastian’s secret is at risk of exposure when his colleagues begin questioning his disappearance. Will he be able to keep his promise and avoid losing himself in a new world where money holds no value, but humanity is everything?\n\nDirector: Fraydun Manocherian, Fred Manocherian\nCast: Victor Alfieri, Ione Skye, Gerry Bamman\nGenres: Comedy, Drama, Romance\n \nHello Friend! Welcome to our KINOPOWER channel, where you will definitely find something interesting for you in the world of movies.\n\nKINOPOWER is an incredible YouTube channel where we strive to bring you the most exciting cinematic experiences across a wide range of genres. Whatever your mood and preferences, we have something special for every viewer.\n\nOn our channel you will find the following movie genres: Action, Drama, Comedy, Science Fiction, Horror, Romance, Fantasy, Documentary - everything and for any taste.\n\nAt KINOPOWER, we prioritize diversity because every story has its own value and can surprise you.\n\nhttps://www.youtube.com/channel/UCTfOoI30RSVYaTnuCZY_Esg/?sub_confirmation=1\n \nSubscribe to our channel to keep up with the latest releases and enjoy our movies! Because cinema is a real power of impressions, and we are happy to share it with you.\n\n#film #movie #drama #romance \n\ntrinianpal455",
  "creator": "Kinopower",
  "thumbnail": "https://i.ytimg.com/vi/XN1DbOEH-uQ/hqdefault.jpg",
  "source": "YouTube",
  "channel": "Kinopower"
}